import React from "react";
import Link from "next/link";

import WhiteSpace from "../../../components/WhiteSpace";
import Italic from "../../../components/Italic";

export default () => {
    return (
        <>
            <h2 className="heading">Історія впровадження мультимедійних технологій в освіту</h2>
            <p className="paragraph">
                <WhiteSpace/>
                Ера сучасних медіа- та веб-технологій розпочалася на початку 90-х
                років минулого століття. У ті часи використання інших комп’ютерних
                технологій, таких, як мультимедійні дошки та ноутбуки, програми для
                створення презентацій <Italic>Microsoft Powerpoint</Italic>, почали набувати свого
                поширення серед вчителів шкіл різних країн, але ця тенденція ще не була
                масовою. Школа-інтернат <Italic>«Methodist Ladies’ College»</Italic> в Австралії стала
                першим навчальним закладом середньої освіти, усі учні якого в 1990 році
                почали використовувати індивідуальні ноутбуки для навчання. Це стало
                гарним прикладом для інших країн, уряди яких звернули увагу на
                ефективність такого нововведення.
            </p>
            <p className="paragraph">
                <WhiteSpace/>
                Із появою Інтернету наприкінці 90-х років минулого століття з’явилися
                візуальні та аудіо джерела, які розширили спектр засобів, що
                використовувалися в початкових класах. Початок XXI століття
                характеризується новим витком упровадження ЕОР в освіту. У деяких
                країнах починають використовувати мультимедійні дошки, які виявилися
                особливо ефективними для навчання молодших школярів. Крім того,
                останнім часом у більшості країн світу все частіше йде мова про перехід до
                електронних підручників. Ще один напрям використання мультимедійних
                технологій в освіті багатьох країн, який з’явився зовсім недавно – це
                впровадження мобільних технологій в освітнє середовище. Отже, можна
                стверджувати, що використання мультимедійних технологій у навчальному
                процесі різних країн, розпочалося в 90-х роках ХХ століття з появою
                мультимедійних ПК; поширеним використанням CD-дисків з анімацією та
                звуком, моделювання, об’єктно-орієнтованих мультимедійних авторських
                розробок.
            </p>
            <div className="more">
                <Link href="/stages"><a>Повернутись</a></Link>
            </div>
        </>
    );
}
