import React from "react";
import Link from "next/link";

import WhiteSpace from "../../../components/WhiteSpace";
import Italic from "../../../components/Italic";
import Bold from "../../../components/Bold";

function DistanceLearning() {
    return (
        <>
            <h2 className="heading">Дистанційне навчання</h2>
            <p className="paragraph">
                <WhiteSpace/>
                <Bold>Дистанційне навчання</Bold> — сукупність сучасних технологій, що забезпечують доставку інформації в інтерактивному режимі за допомогою використання ІКТ 
                (інформаційно-комунікаційних технологій) від тих, хто навчає (викладачів, визначних постатей у певних галузях науки, політиків), до тих, хто навчається 
                (студентів чи слухачів). Застосовується під час підготовки як у середніх загальноосвітніх школах і ЗВО, так і в бізнес-школах. Основними принципами 
                дистанційного навчання є інтерактивна взаємодія у процесі роботи, надання студентам можливості самостійного освоєння досліджуваного матеріалу, а також 
                консультаційний супровід у процесі дослідницької діяльності. Дає змогу навчатися на відстані, за допомогою диспутів експертів із кількох країн, за відсутності 
                викладача. Основну роль у здійсненні дистанційного навчання відіграють сучасні інформаційні технології.
            </p>
            <p className="paragraph">
                <WhiteSpace/>
                В Україні дистанційна форма освіти впроваджується вже понад десять років. Відправною точкою можна вважати 2002 рік, коли <Italic>Міністерством освіти і науки України</Italic> був 
                запроваджений експеримент з дистанційного навчання. Однією з можливостей, яку відкрила перед системою освіти і суспільством загалом впровадження дистанційної освіти 
                була перша затверджена <Italic>Кабінетом Міністрів України</Italic> <Bold>Програма розвитку системи дистанційного навчання</Bold> 2004-2006 р. (постанова КМУ від 23.09.2003 р. № 1494). 
                На виконання програми було розроблене перше <Bold>Положення про дистанційне навчання</Bold>, затверджене наказом <Italic>Міністерства освіти і науки України</Italic> від 21.01.2004 № 40. З розвитком 
                технологій у 2013 році затверджується нове <Bold>Положення про дистанційне навчання.</Bold> Перший заклад загальної середньої освіти в Україні, який отримав ліцензію на провадження 
                освітньої діяльності без очного формату став <Italic>Центр освіти «Дистанційна школа «Оптима»</Italic>. На сьогодні порядок організації та запровадження дистанційного навчання визначено  
                <Bold> Положенням про дистанційну форму здобуття повної загальної середньої освіти</Bold>, затвердженим наказом <Italic>Міністерства освіти і науки України</Italic> від 08.09.2020 № 1115. У 2019-2020 
                навчальному році функціонувало 182 школи, в яких, зокрема, були учні на дистанційній формі навчання. На тепер за оперативною інформацією місцевих органів у сфері освіти 
                таких шкіл уже 233. Серед них – 185 закладів загальної середньої освіти комунальної форми власності та 48 – приватної. 19 шкіл приватної форми власності здійснюють навчання 
                тільки за дистанційною формою.
            </p>
            <div className="more">
                <Link href="/benefits"><a>Повернутись</a></Link>
            </div>
        </>
    );
}

export default DistanceLearning;