import React from "react";
import Head from "next/head";
import Link from "next/link";

import WhiteSpace from "../../../../components/WhiteSpace";
import Bold from "../../../../components/Bold";
import RoadMap from "../../../../components/RoadMap";
import Container from "../../../../components/Container";

import { Headings } from "../../../../utils/continuing_edu";

const Preview = () => {
    return (
        <>
            <Head>
                <title>Безперервна освіта</title>
            </Head>
            <Container>
                <>
                    <RoadMap array={Headings} activeIndex={0}/>  
                    <h2 className="heading">Безперервна освіта</h2>
                    <p className="paragraph">
                        <WhiteSpace/>
                        З давніх років відоме прислів'я: "Вік живи - вік учись". Сьогодні вона знайшла новий сенс - прямий і буквальний: 
                        якщо не хочеш безнадійно відстати від життя, то необхідно постійно навчатися. Освіта впродовж усього життя, яке називають 
                        <Bold> безперервним</Bold> (або <Bold>перманентним</Bold>), стає невід'ємною частиною едюкації.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        За даними досліджень, понад 50% випускників вузів і до 64% випускників середніх спеціальних навчальних 
                        закладів змінюють свою професію відразу після закінчення навчального закладу. Величезна кількість молодих людей змушені заново 
                        вирішувати проблему організації своєї професійної кар'єри. Дослідження також показують, що все менше людей займаються однією 
                        професією все життя: більшість повинна бути готова змінити протягом життя кілька професій. Зрозуміло, що це вимагає вміння 
                        вчитися і швидко переучуватися в разі потреби. В силу зазначених причин освіта протягом усього життя людини стає вкрай необхідним.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        У найближче десятиліття близько 80% використовуваних сьогодні технологій застаріє, а 80% працівників буде мати освіту, отриману понад 
                        10 років тому. Обсяг інформації постійно збільшується, знання і компетенції удосконалюються, і сучасна людина повинна постійно підвищувати 
                        свій освітній рівень, свою професійну майстерність. Здатність до постійного навчання стає найважливішим якістю, що визначає конкурентоспроможність 
                        людини на ринку праці.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        <Bold>Безперервна освіта</Bold> - це цілісний процес, що забезпечує поступальний розвиток творчого потенціалу, результатом якого є всебічний розвиток 
                        інтелекту особистості та її духовного світу. Цей процес складається з послідовних ступенів спеціально організованої едюкації, що забезпечують 
                        якісний приріст нових знань і умінь, способів мислення і діяльності. <Bold>Метою</Bold> безперервної освіти є не тільки цілісний розвиток людини як особистості протягом 
                        усього його життя, але і підвищення можливостей трудової і соціальної адаптації в мінливому світі, розвиток здібностей, прагнень і можливостей.
                    </p>
                    <div className="more">
                        <Link href="/articles/continuing_edu/foreign_experience"><a>Далі</a></Link>
                    </div>
                </>
            </Container>
        </>
    );
};

export default Preview;