import React from "react";
import Link from "next/link";
import Header from "next/head";

import WhiteSpace from "../../components/WhiteSpace";
import RoadMap from "../../components/RoadMap";

import { Headings } from "../../utils/data";

function Preview() {
    return (
        <>
            <Header>
                <title>
                    ІТ у професійній діяльності вчителя
                </title>
            </Header>
            <RoadMap array={Headings} activeIndex={0}/>
            <h2 className="heading">ІТ у професійній діяльності вчителя</h2>
            <p className="paragraph">
                <WhiteSpace/>
                У сучасному світі технологічних змін і зростання конкуренції на ринку праці, 
                необхідність професійного розвитку, можливість йти пліч-о-пліч з технічним прогресом,
                рушійною силою якого вважають технічне мислення, стають вкрай необхідними умовами. 
                Підготовка високо кваліфікованого фахівця потребує впровадження нових інформаційних технологій навчання. 
                Особливу актуальність у сучасних умовах інтенсивного розвитку нових інформаційних технологій на базі 
                загальної комп’ютеризації здобуває організація підготовки вчителя щодо використання інформаційних 
                технологій в професійній діяльності.
            </p>
            <p className="paragraph">
                <WhiteSpace/>
                Одним із пріоритетних завдань реформування освіти є підготовка педагога, здатного до 
                професійної діяльності в умовах впровадження інформаційно-комунікаційних технологій у 
                навчальний процес. Сьогодні інформаційно-комунікаційні технології, як сукупність сучасних 
                методів і засобів отримання й опрацювання даних трансформуються у важіль підвищення ефективності 
                навчально-виховного процесу та управління ним. Враховуючи вимоги сьогодення, вчитель зобов’язаний 
                засвоїти основи економічних знань, мати високу загальну культуру, володіти вміннями організаційної 
                та виховної роботи, іноземною мовою, виявляти ініціативу, бути відповідальним, прагнути до самовдосконалення 
                і самоосвіти, впроваджувати інновації, що дуже важливо, набути навичок роботи з комп’ютерною технікою.
            </p>
            <div className="more">
                <Link href="/more/principles-of-scalling"><a>Дивіться також: Теоретичні засади застосування ІКТ у професійній підготовці майбутніх вчителів</a></Link>
                <Link href="/stages"><a>Далі</a></Link>
            </div>
        </>
    );
}

export default Preview;