import React from "react";
import Link from "next/link";

import WhiteSpace from "../../../../../components/WhiteSpace";
import NewLine from "../../../../../components/NewLine";
import Container from "../../../../../components/Container";

function Principles() {
    return (
        <Container>
            <>
                <h2 className="heading">Теоретичні засади застосування ІКТ у професійній підготовці майбутніх вчителів</h2>
                <p className="paragraph">
                    <WhiteSpace/>
                    Модернізація освітньої системи в Україні відкриває нові горизонти та можливості,
                    але разом із тим висуває підвищені вимоги до професійної підготовки студентів у вищих
                    навчальних закладах. Прискорення процесу засвоєння нових знань вимагає від майбутніх
                    фахівців у галузі комп'ютернмх технологій готовності до постійного оновлення і неперервного
                    вдосконалення своїх професійних можливостей. Саме тому актуальною проблемою підготовки студентів
                    є формування їх інформаційно-комунікаційної культури.
                    <NewLine/>
                    На думку Л. Петухової, ефективне формування інформаційних компетентностей вчителя, готовності до
                    використання ІКТ у навчально-виховному процесі школи здійснюється в науково-обгрунтованому
                    інформаційно-комунікаційному педагогічному середовищі, під яким дослідниця розуміє сукупність знаннєвих, 
                    технологічних і ментальних сутностей, які в синхронній інтеграції забезпечують якісне оволодіння системою
                    відповідних знань. Це середовище має великі функціональні можливості:
                </p>
                <ul className="list vertical">
                    <li>Надає доступ до ресурсів у будь-який зручний час;</li>
                    <li>
                        Володіє зручним, гнучким, дружнім, інтелектуальним сервісом, що допомагає
                        людині знайти необхідні інформаційні ресурси, дані або знання;
                    </li>
                    <li>
                        Дозволяє організувати практично безкоштовні, зручні у часі контакти між будь-якою
                        кількістю людей, забезпечити зручний і гнучкий обмін інформацією (причому в будь-якій формі)
                        між ними та ін.
                    </li>
                </ul>
                <p className="paragraph">
                    Cеред складових інформаційно-комунікаційного педагогічного середовища Л. Петухова виділяє комп'ютерні 
                    та інформаційні технології навчання, педагогічні програмні засоби, створення спеціального програмного 
                    середовища з необхідними для студента дидактичними, методичними матеріалами, творчими завданнями, включенням 
                    елементів автоматизації управління навчальним процесом і обов'язкового надання можливості роботи з ресурсами 
                    глобальної мережі Інтернет.
                </p>
                <div className="more">
                    <Link href="/articles/IT_in_education/preview"><a>Повернутись</a></Link>
                </div>
            </>
        </Container>
    );
}

export default Principles;