import React from "react";
import Head from "next/head";
import Link from "next/link";

import RoadMap from "../../../../components/RoadMap";
import Container from "../../../../components/Container";
import WhiteSpace from "../../../../components/WhiteSpace";
import NewLine from "../../../../components/NewLine";

import { Headings } from "../../../../utils/continuing_edu";

const UkrainianExperience = () => {
    return (
        <>
            <Head>
                <title>Український досвід</title>
            </Head>
            <Container>
                <>
                    <RoadMap array={Headings} activeIndex={2}/>  
                    <h2 className="heading">Український досвід</h2>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Законодавство України про освіту серед основних принципів державної політики визначає сприяння сталому розвитку суспільства шляхом 
                        підготовки конкурентоспроможного людського капіталу та створення умов для освіти протягом життя. В Україні освіта протягом життя 
                        поки що на розвинута системно. Закон України «Про позашкільну освіту» жодним чином не вирішує цієї проблеми, оскільки не врегульовує 
                        питання інтеграції позашкільної освіти в загальну освітню системи країни, залишаючи осторонь ключові проблеми забезпечення і контролю 
                        якості та визнання неформальної освіти. Не існує офіційної статистики з цього питання, відсутні спеціальні концепції і програми. 
                        Навчання протягом життя виходить на чільні позиції у світових освітніх процесах, тому для України вкрай важливо найближчим часом вжити 
                        дієвих заходів для подолання відставання у цій сфері.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Серед загальносвітових тенденцій розвитку суспільства, що обумовлюють поширення в розвинених країнах концепції «освіта протягом життя», 
                        для України особливо актуальними є такі:
                    </p>
                    <ul className="list vertical">
                        <li>
                            Зростання ролі людського капіталу у прирості національного багатства. Людський капітал у національному багатстві світового співавторства 
                            складає 64 %, природний капітал – 20 %, а фізичний лише 16 %. Питома вага людського капіталу у розвинених країнах (Фінляндія, Швейцарія, 
                            Німеччина, Японія, США) становить до 80 % їхнього національного багатства. Основний приріст національного багатства визначається сьогодні, 
                            передусім, умовами, створеними для розкриття людського потенціалу. Однією із найважливіших умов такого розкриття, беззаперечно, виступає 
                            освіта;
                        </li>
                        <li>
                            Несприятливі демографічні тенденції. Зниження народжуваності та старіння населення в викликає потребу у створенні умов для навчання людей 
                            зрілого і старшого віку. Освіта дорослих стає сьогодні важливим чинником соціально-економічного розвитку;
                        </li>
                        <li>
                            Прискорення темпів оновлення професійних знань. Нині щорічно обновляється близько 5 % теоретичних і 20 % професійних знань. Одиниця виміру 
                            старіння знань фахівця, прийнята у США – період «напіврозпаду» компетентності, тобто зниження її на 50 % внаслідок появи нової інформації, 
                            показує, що за багатьма професіями цей період настає менш ніж через 5 років, тобто стосовно вітчизняної системи вищої освіти часто раніше, 
                            ніж закінчується навчання. Вирішення проблеми полягає в переході до освіти протягом життя, де базова освіта періодично повинна доповнюватися 
                            програмами додаткової освіти і організується не як кінцева, завершена, а лише як основа, фундамент для подальшого навчання;
                        </li>
                        <li>
                            Утвердження в європейському освітньому просторі концепції «освіти протягом життя». Навчання протягом життя передбачає зростання інвестицій у 
                            людей і знання; набуття основних навичок, включаючи цифрову грамотність; поширення інноваційних, більш гнучких форм навчання. Мета полягає в 
                            забезпеченні людей будь-якого віку рівним і відкритим доступом до якісного навчання. Рада Європи затвердила навчання протягом життя як один з 
                            основних компонентів європейської соціальної моделі. Таке навчання не обмежується лише сферою освіти – воно також є критичним фактором у сферах 
                            зайнятості й соціального забезпечення, економічного зростання і конкурентоспроможності.
                        </li>
                        <p className="paragraph">
                            <NewLine/>
                            У змісті безперервної освіти прийнято виділяти три основні значимі компоненти, пов’язані з навчанням дорослого населення: навчання грамотності в 
                            широкому сенсі, включаючи комп’ютерну, мовну, соціальну та ін.; професійне навчання, що включає професійну підготовку, перепідготовку, підвищення 
                            кваліфікації (job qualification); загальнокультурну додаткову освіту, не пов’язану із трудовою діяльністю (life qualification). Відповідно, за 
                            цілями, які ставляться й реалізуються в системі неперервної освіти, її умовно можна поділити на три складові.
                        </p>
                        <p className="paragraph">
                            <WhiteSpace/>
                            Перша складова системи освіти протягом життя – додаткова професійна освіта – сприяє формуванню професійної основи кадрового потенціалу сучасної 
                            високотехнологічної економіки. Споживачами послуг даної частини системи неперервної освіта є соціально адаптована частина населення, яке отримує 
                            освіту послідовно на всіх її рівнях. Друга частина системи освіти протягом життя забезпечує різноманітним групам населення можливість адаптуватися 
                            до мінливих умов життя. Ця підсистема передбачає освіту, спрямовану на адаптацію й реабілітацію соціальних і професійних груп, не здатних самостійно 
                            пристосуватися до швидкозмінного соціального середовища. Крім того, до цієї підсистеми залучаються громадяни, що через різні причини не мають доступу 
                            до формальної системи професійної освіти, що створює для них загрозу десоціалізації. Третя складова системи LLL забезпечує задоволення різноманітних 
                            індивідуальних освітніх потреб громадян, наприклад, мовну підготовку, отримання психологічних, культурологічних та інших знань, комунікативних навичок, 
                            спеціальних умінь тощо.
                        </p>
                        <div className="more">
                            <Link href="/articles/continuing_edu/principles"><a>Далі</a></Link>
                        </div>
                    </ul>
                </>
            </Container>
        </>
    );  
};

export default UkrainianExperience;