import React from "react";
import Link from "next/link";
import Head from "next/head";

import Container from "../../../../components/Container";
import WhiteSpace from "../../../../components/WhiteSpace";
import Bold from "../../../../components/Bold";
import NewLine from "../../../../components/NewLine";
import RoadMap from "../../../../components/RoadMap";

import { Headings } from "../../../../utils/continuing_edu";

const Principles = () => {
    return (
        <>
             <Head>
                <title>Принципи освіти протягом життя</title>
            </Head>
            <Container>
                <>
                    <RoadMap array={Headings} activeIndex={3}/>  
                    <h2 className="heading">Принципи освіти протягом життя</h2>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Усвідомлення важливості освіти протягом життя для людського розвитку призвело на початку XXI століття до модернізації європейської політики у сфері освіти. 
                        Лісабонський саміт Ради Європи у березні 2000 року прийняв «Меморандум освіти протягом життя» (A Memorandum of Lifelong Learning). В Меморандумі підкреслюється, 
                        що безперервна освіта повинна стати головною політичною програмою громадянського суспільства, соціальної єдності й зайнятості. Визначення безперервної освіти 
                        включає: отримання ступенів та дипломів у вільний час; професійні курси, в тому числі з метою підвищення кваліфікації персоналу; освіта для дорослих; друга 
                        освіта інше. Також у Меморандумі було визначено шість принципів безперервної освіти.
                    </p>
                    <p className="paragraph">
                        <NewLine/>
                        <Bold>Принцип 1. Нові базові знання і навички для всіх.</Bold>
                        <NewLine/>
                        Мета: гарантувати загальний неперервний доступ до освіти для отримання й поновлення навичок, необхідних для включення людини в інформаційне суспільство. 
                        Підсумкові документи Лісабонського саміту відносять до таких навичок комп’ютерну грамотність, іноземні мови, технологічну культуру, підприємництво та 
                        соціальні навички.
                    </p>
                    <p className="paragraph">
                        <NewLine/>
                        <Bold>Принцип 2. Збільшення інвестицій в людські ресурси.</Bold>
                        <NewLine/>
                        Мета: значно збільшити інвестиції в людські ресурси для підняття пріоритету найважливішого надбання Європи – її людей. В останніх документах ЄС пропонується 
                        підвищувати капіталовкладення в людські ресурси, діючи на основі соціального партнерства і поширюючи досвід передових компаній.
                    </p>
                    <p className="paragraph">
                        <NewLine/>
                        <Bold>Принцип 3. Інноваційні методики викладання й навчання.</Bold>
                        <NewLine/>
                        Мета: Розробити нові методології навчання для системи безперервної освіти протягом життя. З розвитком інформаційного суспільства освітні технології стають 
                        усе більше орієнтованими на користувача. Методи навчання як у формальній, так і в неформальній системі освіти повинні орієнтуватися на користувача, 
                        змінюватися в напрямку особистісної мотивації, критичного мислення й уміння навчатись.
                    </p>
                    <p className="paragraph">
                        <NewLine/>
                        <Bold>Принцип 4. Нова система оцінки отриманої освіти.</Bold>
                        <NewLine/>
                        Мета: Докорінно змінити підходи до розуміння і визнання навчальної діяльності та її результатів, особливо у сфері неформальної та інформальної освіти. 
                        Визнання такої освіти допоможе підвищити мотивацію до безперервної освіти. Актуалізується потреба у розробці якісної системи «Акредитації попередньої 
                        і неформальної освіти» (Accreditation of Prior and Experiential Learning – APEL).
                    </p>
                    <p className="paragraph">
                        <NewLine/>
                        <Bold>Принцип 5. Розвиток наставництва й консультування.</Bold>
                        <NewLine/>
                        Мета: забезпечити кожному протягом усього життя вільний доступ до інформації про освітні можливості та до необхідних консультацій і рекомендацій. Має 
                        бути створена постійна консультаційна служба, яка надаватиме рекомендації в сфері освітнього, професійного та особистісного розвитку і буде орієнтована 
                        на інтереси та потреби активного користувача.
                    </p>
                    <p className="paragraph">
                        <NewLine/>
                        <Bold>Принцип 6. Наближення освіти до місця проживання.</Bold>
                        <NewLine/>
                        Мета: наблизити освітні можливості до місця проживання споживачів за допомогою мережі навчальних та консультаційних пунктів і використання інформаційних 
                        технологій. Маючи свободу пересування люди не повинні, однак, бути змушеними залишати своє рідне місто чи село для отримання якісної освіти.
                    </p>
                    <div className="more">
                        <Link href="/articles/continuing_edu/overview"><a>Далі</a></Link>
                    </div>
                </>
            </Container>
        </>
    );
};

export default Principles;