import React from "react";
import Head from "next/head";
import Link from "next/link";

import WhiteSpace from "../../../../components/WhiteSpace";
import Bold from "../../../../components/Bold";
import RoadMap from "../../../../components/RoadMap";
import Container from "../../../../components/Container";

import { Headings } from "../../../../utils/continuing_edu";

const ForeignExperience = () => {
    return (
        <>
            <Head>
                <title>Іноземний досвід</title>
            </Head>
            <Container>
                <>
                    <RoadMap array={Headings} activeIndex={1}/>  
                    <h2 className="heading">Іноземний досвід</h2>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Європейська Комісія об’єднала різні освітні й навчальні ініціативи в єдину Програму навчання протягом життя (Lifelong Learning Programme). 
                        Ця програма прийшла на зміну програмам професійного та дистанційного навчання, що існували до 2006 року.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Навчання протягом життя має на увазі зростання інвестицій у людей і знання; набуття основних навичок, включаючи цифрову грамотність і розширення 
                        можливості для інноваційної, більш гнучкої форми навчання. Мета полягає в тому, щоб забезпечити людей будь-якого віку рівним і відкритим доступом 
                        до якісного навчання. Навчання протягом життя охоплює все цілеспрямоване навчання, формальне чи неформальне, з метою розширення знань, поліпшення 
                        навичок і компетентності.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Рада Європи затвердила навчання протягом життя як один з основних компонентів європейської соціальної моделі. Таке навчання не обмежується лише 
                        сферою освіти; воно також є критичним чинником у сферах зайнятості й соціального забезпечення, економічного зростання і конкурентоспроможності.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Європейська стратегія зайнятості (European employment strategy)[2], погоджена 22 липня 2003 р., визначила керівні принципи політики розвитку 
                        навчання протягом життя. Ці керівні принципи закликають країни ЄС звернути увагу на дефіцит робочої сили з відповідними навичками і заохочують 
                        їх здійснювати всебічні стратегії навчання протягом життя, щоб озброїти громадян навичками, необхідними у сучасній економіці. Керівні принципи 
                        визначають необхідність збільшення інвестицій в людські ресурси, особливо через навчання дорослих підприємствами.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Стан розвитку освіти протягом життя постійно перебуває в центрі уваги різноманітних європейський інститутів. Зокрема, регулярно проводяться відповідні 
                        статистичні дослідження. В одному з останніх цільова група для отримання статистичних даних щодо навчання протягом життя включає людей у віці між 25 і 
                        64 роками і обмежується періодом чотирьох тижнів перед опитуванням. Дані наведено за оглядом „Quality Report on the European Union Labour Force Survey 
                        2007”.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        У 2007 р. відсоток людей віком від 25 до 64 років, задіяних у різноманітних формах навчання протягом життя, сткладав 9,7 % у межах ЄС. Це на 1,2 % вище, 
                        ніж у 2003 році. Серед жінок цей відсоток (10,6 %) вищий, ніж серед чоловіків (8,8 %). Найбільш високий відсоток громадян, задіяних у різних формах навчання 
                        протягом життя, у Швеції, Данії, Великобританії та Фінляндії – від 23 % до 32 %. Найнижчі показники у Болгарії та Румунії – менше 2 %.
                        <WhiteSpace/>
                        Відсоток усіх підприємств, що забезпечили навчання своїм працівникам, складає від 21 % у Греції до 90 % у Великобританії та 60 % в середньому по ЄС. Позитивна 
                        динаміка спостерігається в більшості країн, що в останні роки приєдналися до ЄС. Початкове професійне навчання в межах підприємств найбільш розвинене у Німеччині, 
                        Великобританії, Австрії, Данії, Нідерландах, Італії та Франції – близько 50 % підприємств, у той час, як у більшості інших країн ЄС  воно практикується не більше, 
                        як на 10 % підприємств.
                    </p>
                    <p className="paragraph">
                        <WhiteSpace/>
                        Дуже показовою є кореляція між рівнем попередньої освіти та ступенем залученням до навчання дорослого населення віком від 25 до 64 років, що свідчить про більші 
                        можливості й більшу схильність до продовження навчання людей з вищим рівнем попередньої освіти. Освіта протягом життя в усьому світі й особливо в розвинених країнах стає усе більш важливою сферою освітніх послуг.
                    </p>
                    <div className="more">
                        <Link href="/articles/continuing_edu/ukrainian_experience"><a>Далі</a></Link>
                    </div>
                </>
            </Container>
        </>
    );
};

export default ForeignExperience;